<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Exceed onDemand Client.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.exceedondemandclient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Exceed onDemand Client</string>
        <key>SEARCH_URL</key>
        <string>http://connectivity.opentext.com/products/mac-os-x-platforms.aspx</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http.*?eodclient8-.*\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>eodclient.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
