<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Mendeley Desktop and copies the package to the build directory with an appended version number.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.pkg.Mendeley</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mendeley</string>
		  <key>APPNAME</key>
		  <string>Mendeley Desktop</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.Mendeley</string>
    <key>Process</key>
    <array>
       <dict>
           <key>Arguments</key>
           <dict>
               <key>dmg_path</key>
               <string>%pathname%</string>
           </dict>
           <key>Processor</key>
           <string>AppDmgVersioner</string>
       </dict>
       <dict>
           <key>Processor</key>
           <string>PkgRootCreator</string>
           <key>Arguments</key>
           <dict>
               <key>pkgroot</key>
               <string>%RECIPE_CACHE_DIR%/%NAME%</string>
               <key>pkgdirs</key>
               <dict>
                   <key>Applications</key>
                   <string>0775</string>
               </dict>
           </dict>
       </dict>
       <dict>
           <key>Processor</key>
           <string>Copier</string>
           <key>Arguments</key>
           <dict>
               <key>source_path</key>
               <string>%pathname%/%APPNAME%.app</string>
               <key>destination_path</key>
               <string>%pkgroot%/Applications/%APPNAME%.app</string>
           </dict>
       </dict>
       <dict>
           <key>Processor</key>
           <string>PkgInfoCreator</string>
           <key>Arguments</key>
           <dict>
               <key>template_path</key>
               <string>PackageInfoTemplate</string>
               <key>infofile</key>
               <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
               <key>pkgtype</key>
               <string>flat</string>
           </dict>
       </dict>
       <dict>
           <key>Processor</key>
           <string>PkgCreator</string>
           <key>Arguments</key>
           <dict>
               <key>pkg_request</key>
               <dict>
                   <key>pkgname</key>
                   <string>%NAME%-%version%</string>
                   <key>id</key>
                   <string>com.mendeley.desktop.pkg</string>
                   <key>resources</key>
                   <string>Resources</string>
                   <key>chown</key>
                   <array>
                       <dict>
                           <key>path</key>
                           <string>Applications</string>
                           <key>user</key>
                           <string>root</string>
                           <key>group</key>
                           <string>wheel</string>
                       </dict>
                   </array>
               </dict>
           </dict>
       </dict>
    </array>
</dict>
</plist>