<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MacPorts. Valid options for MACPORTS_REQUESTED_OS are:'10.12-Sierra (default), 10.11-ElCapitan, 10.10-Yosemite', '10.9-Mavericks', '10.8-MountainLion'.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.MacPorts</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MacPorts</string>
        <key>MACPORTS_REQUESTED_OS</key>
        <string>Sonoma</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>macports/macports-base</string>
                <key>asset_regex</key>
                <string>MacPorts-[0-9.]+-[0-9]+-%MACPORTS_REQUESTED_OS%\.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Joshua Root (QTA3A3B7F3)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
    </array>
</dict>
</plist>
