<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest MacPorts package for 10.10-Yosemite and installs it. Use -k MACPORTS_REQUESTED_OS for other options.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.install.MacPorts</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MacPorts</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.MacPorts</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
