<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Fetch.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Fetch</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Fetch</string>
        <key>DOWNLOAD_URL</key>
        <string>http://fetchsoftworks.com/fetch/download/</string>
        <key>SEARCH_URL</key>
        <string>http://fetchsoftworks.com/fetch/download/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;dmg&gt;Fetch_.*\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%%dmg%?direct=1</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Fetch.app</string>
                <key>requirement</key>
                <string>(anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.7] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = BXJFHF532H or certificate leaf = H"ca9259687dfe779227ff3631a0e459b204587eb8") and identifier "com.fetchsoftworks.Fetch"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
