<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version Stellarium for Windows. Valid PLATFORM values are: win32 or win64 (default is win64)</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Stellarium-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Stellarium</string>
        <key>PLATFORM</key>
        <string>win64</string>
        <key>SEARCH_URL</key>
        <string>https://sourceforge.net/projects/stellarium/rss?path=/Stellarium</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%-%PLATFORM%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;https://sourceforge\.net/projects/stellarium/files/[Ss]tellarium-%PLATFORM%/[0-9.]+/[Ss]tellarium-(?P&lt;version&gt;[0-9.]+)-%PLATFORM%\.exe)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%-%version%-%PLATFORM%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
