<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version Stellarium.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Stellarium</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Stellarium</string>
        <key>SEARCH_URL</key>
        <string>https://stellarium.org</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https://github.com.*(?P&lt;version&gt;[0-9]{1,2}.[0-9]{1,2}.[0-9]{1,2}).zip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Too many Stellarium recipes, getting rid of this one. I suggest com.github.ahousseini-recipes.download.Stellarium</string>
            </dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
