<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of 3DCoat.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.3DCoat</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>3DCoat</string>
        <key>SEARCH_URL</key>
        <string>https://3dcoat.com/download/</string>
        <key>SEARCH_PATTERN</key>
        <string>&lt;span class="download-icon"&gt;(?P&lt;version&gt;[0-9.]+)&lt;\/span&gt;</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
            <key>Arguments</key>
            <dict>
                <key>output_var_name</key>
                <string>formatted_version</string>
                <key>bes_relevance</key>
                <string>concatenation "-" of substrings separated by "." of "%version%"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://3dcoat.com/pilgway/sergyi/3D-CoatV%formatted_version%.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
