<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of EndNote for OS X.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.EndNoteX7</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>EndNote</string>
        <key>ENDNOTE_MAJOR_VERSION</key>
        <string>X7</string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.endnote.com/downloads/%ENDNOTE_MAJOR_VERSION%/EndNote%ENDNOTE_MAJOR_VERSION%Installer.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>