<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MakerBot Desktop. Use the following 'PLATFORM' keys to change OS selection: x86, x64</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.MakerBotDesktop-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakerBot Desktop</string>
        <key>SEARCH_URL</key>
        <string>https://www.makerbot.com/download-desktop/</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>USER_AGENT</key>
        <string>curl/7.21.4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>"(?P&lt;url&gt;https:\/\/downloads\.makerbot\.com\/makerware\/MakerBot_Bundle.*?_(?P&lt;version&gt;[A-z0-9._ ]+)_%PLATFORM%_Install.exe)"</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
