<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MakerBot Desktop. Use the following 'PLATFORM' keys to change OS selection: x86, x64</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.MakerBotPrint</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakerBot Desktop</string>
        <key>SEARCH_URL</key>
        <string>https://www.makerbot.com/download-print/</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>USER_AGENT</key>
        <string>curl/7.21.4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(https:\/\/s3.amazonaws.com\/downloads-makerbot-com\/installer\/release\/MakerBotDesktopInstaller.pkg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
           <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            </dict>
        </dict>
         <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/MakerBotPrint.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%Payload</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%Payload/MakerBot Print.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
