<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MakerBot Desktop. Use the following 'PLATFORM' keys to change OS selection: x86, x64</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.MakerBotPrint-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MakerBot Desktop</string>
        <key>SEARCH_URL</key>
        <string>https://www.makerbot.com/download-print/</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>USER_AGENT</key>
        <string>curl/7.21.4</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>MakerBot Print is no longer in active development (details: https://support.ultimaker.com/s/article/How-to-download-MakerBot-Print-for-Windows-and-Mac). This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(https:\/\/s3.amazonaws.com\/downloads-makerbot-com\/installer\/release\/MakerBotPrintInstaller.exe)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>Download MakerBot Print ([0-9]{1,}.[0-9]{1,})</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
