<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Amazon Music Player.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.AmazonMusic</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Amazon Music</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>"(https://d2j9xt6n9dg5d3\.cloudfront\.net/mac/[0-9a-f_]+/Amazon\+Music\+Installer\.dmg)"</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>url</key>
                <string>https://qatgqujbd2.execute-api.us-west-2.amazonaws.com/prod/getCurrentVersion</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7)</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Amazon Music Installer.app</string>
                <key>requirement</key>
                <string>identifier "com.bitrock.appinstaller" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "94KV3E626L"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
