<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of VLC for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.VLC-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VLC</string>
        <key>SEARCH_URL</key>
        <string>https://www.videolan.org/vlc/download-windows.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;get\.videolan\.org\/vlc\/(?P&lt;version&gt;[0-9.]+)\/win32\/vlc-[0-9.]+-win32\.exe)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://%url%</string>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
