<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of SPEAR (Sinusoidal Partial Editing Analysis and Resynthesis).</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.SPEAR</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SPEAR</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.klingbeil.com/spear/downloads/files/SPEAR_latest.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/SPEAR.app</string>
                <key>requirement</key>
                <string>identifier "com.klingbeil.spear" and certificate leaf = H"309882b2d525547eafa8febfe9639552d5fa2363"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>