<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Meshmixer.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Meshmixer</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Meshmixer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
      <dict>
        <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://meshmixer.com/download.html</string>
          <key>re_pattern</key>
          <string>href=.*?/Autodesk_Meshmixer_v?(\d+p\d+)_MacOS\.pkg</string>
          <key>result_output_var_name</key>
          <string>url_version</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>https://www.meshmixer.com/downloads/Autodesk_Meshmixer_v%url_version%_MacOS.pkg</string>
          <key>filename</key>
          <string>%NAME%.pkg</string>
        </dict>
      </dict>
      <dict>
        <key>Processor</key>
        <string>EndOfCheckPhase</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>expected_authority_names</key>
          <array>
            <string>Developer ID Installer: Autodesk (XXKJ396S2Y)</string>
            <string>Developer ID Certification Authority</string>
            <string>Apple Root CA</string>
          </array>
          <key>input_path</key>
          <string>%pathname%</string>
        </dict>
        <key>Processor</key>
        <string>CodeSignatureVerifier</string>
      </dict>
    </array>
  </dict>
</plist>
