<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest source of AutoPkgBESEngine.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.BESPythonAPI</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BESPythonAPI</string>
        <key>DOWNLOAD_URL</key>
        <string>https://git.psu.edu/sysman/python-besapi/-/archive/master/python-besapi-master.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>