<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest source of AutoPkgBESEngine, and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.pkg.BESPythonAPI</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BESPythonAPI</string>
        <key>pythonversion</key>
        <string>3.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.BESPythonAPI</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <string>True</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source</string>
                <key>archive_format</key>
                <string>zip</string>
            </dict>
        </dict>
        <!-- <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>result_output_var_name</key>
                <string>pythonversion</string>
                <key>url</key>
                <string>https://raw.githubusercontent.com/autopkg/autopkg/master/.github/workflows/tests.yaml</string>
                <key>re_pattern</key>
                <string>python-version: ([0-9.]+)</string>

            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>url</key>
                <string>https://git.psu.edu/sysman/python-besapi/raw/master/besapi.py</string>
                <key>re_pattern</key>
                <string>__version__ = \'(?P&lt;version&gt;[0-9.]+)\'</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root; we'll extract things from the zip file here.</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>01775</string>
                    <key>Library/AutoPkg</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/Python3</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/Python3/Python.framework</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/Python3/Python.framework/Versions</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/Python3/Python.framework/Versions/Current</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/Python3/Python.framework/Versions/Current/lib</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.10</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.10/site-packages</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy chardet module to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/python-besapi-master/modules/chardet</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python%pythonversion%/site-packages/chardet</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy idna module to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/python-besapi-master/modules/idna</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python%pythonversion%/site-packages/idna</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy lxml module to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/python-besapi-master/modules/lxml</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python%pythonversion%/site-packages/lxml</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy requests module to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/python-besapi-master/modules/requests</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.7/site-packages/requests</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy urllib3 module to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/python-besapi-master/modules/urllib3</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.7/site-packages/urllib3</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-Source/python-besapi-master/modules</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy besapi module to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/python-besapi-master</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/Python3/Python.framework/Versions/Current/lib/python3.7/site-packages/besapi</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Finally! Build an Apple package.</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>id</key>
                    <string>edu.psu.pkg.BESPythonAPI</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-Source</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
