<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version SAOImageDS9.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.SAOImageDS9</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SAOImageDS9</string>
        <!-- other values for SAO_OS_KEY include darwinhighsierra, darwinelcapitan -->
        <key>SAO_OS_KEY</key>
        <string>darwinbigsurx86</string>
        <!-- leave SAO_REQUESTED_VERSION blank to pull the latest version -->
        <key>SAO_REQUESTED_VERSION</key>
        <string></string>
        <key>SEARCH_URL</key>
        <string>https://ds9.si.edu/download</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%/%SAO_OS_KEY%/</string>
                <key>re_pattern</key>
                <string>(?P&lt;tar_gz_file&gt;ds9\.%SAO_OS_KEY%\.(?P&lt;version&gt;%SAO_REQUESTED_VERSION%.*?)\.tar.gz)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%/%SAO_OS_KEY%/%tar_gz_file%</string>
                <key>filename</key>
                <string>%NAME%-%SAO_OS_KEY%.tar.gz</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
