<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version SAOImageDS9 app.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.SAOImageDS9-app</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SAOImageDS9-app</string>
        <!-- other values for SAO_OS_KEY include macoshighsierra, macosxelcapitan -->
        <key>SAO_OS_KEY</key>
        <string>macosbigsur</string>
        <!-- leave SAO_REQUESTED_VERSION blank to pull the latest version -->
        <key>SAO_REQUESTED_VERSION</key>
        <string></string>
        <key>SEARCH_URL</key>
        <string>https://ds9.si.edu/download</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%/%SAO_OS_KEY%/?C=M;O=D</string>
                <key>re_pattern</key>
                <string>(?P&lt;dmg&gt;SAOImage(\%20)?DS9\%20(?P&lt;version&gt;%SAO_REQUESTED_VERSION%.*?)\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%/%SAO_OS_KEY%/%dmg%</string>
                <key>filename</key>
                <string>SAOImageDS9-%SAO_OS_KEY%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
