<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Dymo Label for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.DymoLabel-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DymoLabel</string>
        <key>SEARCH_URL</key>
        <string>http://www.dymo.com/en-US/online-support/dymo-user-guides</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http://download\.dymo\.com/dymo/Software/Win/DCDSetup(?P&lt;version&gt;[0-9.]*)\.exe)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <!-- <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.dymo.com/dymo/Software/Win/DCDSetup1.3.2.exe</string>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>extract_dir</key>
                <string>ExeExtract</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
            <key>Arguments</key>
            <dict>
                <key>bes_relevance</key>
                <string><![CDATA[first matches(regex("([0-9]{1,3}\.){3}([0-9]{1,4})")) of substrings separated by "    " of following text of first "ProductVersion" of substrings separated by "      " of concatenation "" of substrings separated by "%00" of lines of file "%RECIPE_CACHE_DIR%/EXEExtract/version.txt" of encoding "ISO-8859-1" as  string]]></string>
                <key>output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/ExeExtract</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
