<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Oracle's Java 8 for . Finds and downloads the latest Oracle Java 8 JRE CPU release.

Read more about CPU and PSU releases here:
    http://www.oracle.com/technetwork/java/javase/downloads/cpu-psu-explained-2331472.html

To use this recipe, you must accept the Oracle Binary Code License Agreement for Java SE.
http://www.oracle.com/technetwork/java/javase/terms/license/index.html

</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.OracleJava8-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Java8JRE</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.gregneagle.autopkg.sharedprocessors/DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Java 8 has reached end of support. This recipe is now non-functional. Please remove it from your list of recipes.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.oracle.com/technetwork/java/javase/downloads/jre8-downloads-2133155.html</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://download.oracle.com/otn-pub/java/jdk/.*?/jre-8u.*?-windows-i586\.exe)</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                    <key>Cookie</key>
                    <string>oraclelicense=accept-securebackup-cookie</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
