<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Java 10 JDK from Oracle.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.OracleJava10JDK</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OracleJava10JDK</string>
        <key>SEARCH_URL</key>
        <string>https://www.oracle.com/technetwork/java/javase/downloads/jdk10-downloads-4416644.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http://download.oracle.com/otn-pub/java/jdk.*?/jdk-10\.[0-9\.]+_osx-x64_bin\.dmg)</string>
        <key>ORACLE_LICENSE_COOKIE</key>
        <string>oraclelicense=accept-securebackup-cookie</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Java SE 10 has reached end of support. This recipe is now non-functional. Please remove it from your list of recipes.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>TRUEPREDICATE</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>request_headers</key>
                <dict>
                        <key>Cookie</key>
                        <string>%ORACLE_LICENSE_COOKIE%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/JDK 10*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Oracle America, Inc. (VB5E2TV963)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
