<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs the latest Java 8 JDK from Oracle.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.install.OracleJava8JDK</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.OracleJava8JDK</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OracleJava8JDK</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%/JDK 8 Update [0-9][0-9].pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>