<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Box Tools for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.BoxEdit-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Box Tools</string>
        <key>DOWNLOAD_URL</key>
        <string>https://e3.boxcdn.net/box-installers/boxedit/win/currentrelease/BoxToolsInstaller-AdminInstall.msi</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/MSIVersionProvider</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
