<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Box Sync for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.BoxSync-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Box Sync</string>
        <key>DOWNLOAD_URL</key>
        <string>https://e3.boxcdn.net/box-installers/sync/Sync+4+External/BoxSyncSetup.exe#</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/HachoirMetaDataProvider</string>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>BESRelevanceProvider</string>
            <key>Arguments</key>
            <dict>
                <key>bes_filepath</key>
                <string>%pathname%</string>
                <key>output_var_name</key>
                <string>version</string>
                <key>bes_relevance</key>
                <string>(if (last 2 of it = ".0") then substring (0, length of it - 2) of it else it) of "%version%"</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
