<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version SonicVisualiser.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.SonicVisualiser</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SonicVisualiser</string>
        <key>SEARCH_URL</key>
        <string>http://www.sonicvisualiser.org/download.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https://code\.soundsoftware\.ac\.uk/attachments/download/[0-9]*/Sonic%20Visualiser-[.0-9]*\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Sonic Visualiser.app</string>
                <key>requirement</key>
                <string>identifier "org.sonicvisualiser.SonicVisualiser" and (anchor apple generic and certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = M2H8666U82)</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
