<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Sibelius.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Sibelius</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Sibelius</string>
        <key>SEARCH_URL</key>
        <string>https://apps.avid.com/SibeliusTrial/registered_x10.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http://cdn.avid.com/Sibelius/Sibelius_.*?/.*?/Sibelius_(?P&lt;version&gt;.*?)_Mac\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Install Sibelius *.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Avid Technology Inc</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
