<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest verison of Zotero for Windows</string>
	<key>Identifier</key>
	<string>com.github.hansen-m.download.zotero-win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Zotero</string>
		<key>SEARCH_URL</key>
		<string>https://www.zotero.org/download/</string>
		<key>SEARCH_PATTERN</key>
		<string>(?P&lt;exe&gt;download.zotero.org/standalone/[0-9.]+/Zotero-[0-9.]+_setup\.exe)</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
        	<string>URLDownloader</string>
        	<key>Arguments</key>
        	<dict>
        		<key>url</key>
        		<string>http://%exe%</string>
        		<key>filename</key>
        		<string>%NAME%.exe</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>