<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Zoom 64bit.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.zoom-win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Zoom</string>
        <key>DOWNLOAD_URL</key>
        <string><![CDATA[/client/(?P<majorversion>[0-9]{1,4}.[0-9]{1,4}.[0-9]{1,4}.[0-9]{1,4})/ZoomInstallerFull.msi\?archType=x64]]></string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 10.0; Win64; x64)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://zoom.us/download#client_4meeting</string>
                <key>re_pattern</key>
                <string><![CDATA[/client/(?P<majorversion>[0-9]{1,4}.[0-9]{1,4}.[0-9]{1,4}.[0-9]{1,4})/ZoomInstallerFull.msi\?archType=x64]]></string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%64.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/MSIInfoVersionProvider</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
