<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Apple provided Canon Printer Drivers.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.CanonPrinterDrivers</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CanonPrinterDrivers</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AppleRSSInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>title_regex</key>
                <string>Canon Laser Printer Drivers v.*? for OS X</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%link%</string>
                <key>re_pattern</key>
                <string>(?P&lt;dl_path&gt;/downloads/DL.*?/.*?/CanonLaserPrintDrvs(?P&lt;version&gt;.*?)\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://support.apple.com%dl_path%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>