<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Sound Studio.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.SoundStudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SoundStudio</string>
        <key>DOWNLOAD_URL</key>
        <string>https://s3.amazonaws.com/felttip.ss-downloads/</string>
        <key>SEARCH_URL</key>
        <string>http://felttip.com/ss/downloads.html</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;dmg&gt;sound_studio_.*\.zip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%%dmg%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
