<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of ImgBurn for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.ImgBurn-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ImgBurn</string>
        <key>SEARCH_URL</key>
        <string>http://imgburn.com/index.php?act=download</string>
        <key>SEARCH_PATTERN</key>
        <string>Current version\: (?P&lt;version&gt;[0-9.]+)</key>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://download.imgburn.com/SetupImgBurn_%version%.exe</string>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>