<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version CrashPlan PROe Client.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.CrashPlanPROeClient-Linux</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CrashPlanPROe</string>
        <key>SEARCH_URL</key>
        <string>https://www.crashplan.com/shared/js/cp.download.js</string>
        <key>SEARCH_PATTERN</key>
        <string>cp.download.CPPROE_CLIENT_VERSION = \'(?P&lt;version&gt;.*?)\';</string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.crashplan.com/installs/linux/install/CrashPlanPROe/</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%CrashPlanPROe_%version%_Linux.tgz</string>
                <key>filename</key>
                <string>%NAME%.tgz</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
