<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Zimbra Desktop.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.zimbradesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Zimbra Desktop</string>
        <key>SEARCH_URL</key>
        <string>https://www.zimbra.com/downloads/zimbra-desktop/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https:\/\/s3\.amazonaws\.com\/files\.zimbra\.com\/downloads\/zdesktop\/(?P&lt;version&gt;[0-9.]+)\/.*?\/zdesktop_.*?_macos_intel\.dmg)</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_3) AppleWebKit/536.28.10 (KHTML, like Gecko) Version/6.0.3 Safari/536.28.10</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>zdesktop.dmg</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Zimbra Desktop.mpkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Zimbra, Inc. (WNV9Z362HD)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
