<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Zimbra Desktop.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.zimbradesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Zimbra Desktop</string>
        <key>SEARCH_URL</key>
        <string>https://www.zimbra.com/downloads/zimbra-desktop/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https://files\.zimbra\.com/downloads/zxui/(?P&lt;version&gt;[\d\.]+)/Zimbra_Desktop_[\d\.]+_[0-9a-f_]+\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Zimbra Desktop.app</string>
                <key>requirement</key>
                <string>identifier "Zimbra.zm-x-web" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = ZT347VSDFT</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
