<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest iTunes installer for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.iTunes-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>iTunes</string>
        <key>SEARCH_URL</key>
        <string>https://swdlp.apple.com/iframes/82/en_us/82_en_us.html</string>
        <key>SEARCH_PATTERN</key>
        <string>id='system_OS_Hide_Show:6:win:64bit:radio:binaryUrl' value='(?P&lt;exe&gt;https://secure-appldnld\.apple\.com/itunes../.*?/itunes6464setup\.exe)'</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; AS; rv:11.0) like Gecko</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CURLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%exe%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>ExeExtract</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>BESRelevanceProvider</string>
            <key>Arguments</key>
            <dict>
                <key>bes_filepath</key>
                <string>%pathname%</string>
                <key>output_var_name</key>
                <string>msi_path</string>
                <key>bes_relevance</key>
                <string>pathname of file whose (name of it starts with "iTunes" AND name of it ends with ".msi") of folder "%RECIPE_CACHE_DIR%/ExeExtract"</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/MSIVersionProvider</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%msi_path%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/ExeExtract</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>