<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of QuickTime for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.QuickTime-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>QuickTime</string>
        <key>SEARCH_URL</key>
        <string>https://support.apple.com/kb/DL837?locale=en_US</string>
        <key>VERSION_PATTERN</key>
        <string>&lt;h1 id="main-title"&gt;Download QuickTime (?P&lt;display_version&gt;[0-9.]+) for Windows&lt;/h1&gt;</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https:\/\/secure-appldnld\.apple\.com\/[Qq]uick[Tt]ime\/[A-Fa-f0-9]{3}-?[A-Fa-f0-9]{5}-?[A-Fa-f0-9]{8}-?[A-Fa-f0-9]{8}-?[A-Fa-f0-9]{4}-?[A-Fa-f0-9]{4}-?[A-Fa-f0-9]{4}-?[A-Fa-f0-9]{12}\/[Qq]uick[Tt]ime[Ii]nstaller\.exe)</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; AS; rv:11.0) like Gecko</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%VERSION_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>EXEExtract</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/MSIVersionProvider</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%RECIPE_CACHE_DIR%/EXEExtract/QuickTime.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/EXEExtract</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
