<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest source of AutoPkgBESEngine, and creates a package.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.pkg.AutoPkgBESEngine</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BESEngine</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.AutoPkgBESEngine</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>purge_destination</key>
                <string>True</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source</string>
                <key>archive_format</key>
                <string>zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://git.psu.edu/sysman/besengine/raw/master/Code/AutoPkgBESEngine.py</string>
                <key>re_pattern</key>
                <string>__version__ = \'(?P&lt;version&gt;[0-9.]+)\'</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Create a pkg root; we'll extract things from the zip file here.</string>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>01775</string>
                    <key>Library/AutoPkg</key>
                    <string>0775</string>
                    <key>Library/AutoPkg/autopkglib</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy processor to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/besengine-master/Code/AutoPkgBESEngine.py</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/autopkglib/AutoPkgBESEngine.py</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy processor to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/besengine-master/Code/BESImporter.py</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/autopkglib/BESImporter.py</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy processor to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/besengine-master/Code/BESUploader.py</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/autopkglib/BESUploader.py</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Copy processor to new pkgroot</string>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-Source/besengine-master/Code/BESRelevanceProvider.py</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/autopkglib/BESRelevanceProvider.py</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Comment</key>
            <string>Finally! Build an Apple package.</string>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%/</string>
                    <key>id</key>
                    <string>edu.psu.pkg.BESEngine</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <string>%RECIPE_CACHE_DIR%/%NAME%-Source</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
