<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Auralia Cloud. Important: You must override SCHOOL_CODE with the value unique to your organization.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.AuraliaCloud</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AuraliaCloud</string>
        <key>SCHOOL_CODE</key>
        <string>#</string>
        <key>SEARCH_URL</key>
        <string>http://www.risingsoftware.com/cloudsupport/download.php</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http://download\.risingsoftware\.com/auralia./cloud/auralia_m_(?P&lt;version&gt;.*?)_cloud.pkg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%?school_code=%SCHOOL_CODE%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>