<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest GIMP for Mac OS X where MAJOR_OS_VERSION is SL-Lion-ML, MountainLion or Mavericks (default).</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.gimponosx</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GIMP</string>
        <key>MAJOR_OS_VERSION</key>
        <string>Mavericks</string>
        <key>SEARCH_URL</key>
        <string>https://sourceforge.net/api/file/index/project-id/211713/mtime/desc/limit/20/rss</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;http.*?%MAJOR_OS_VERSION%.*?dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>This recipe is now depricated. Please remove it from your list of recipes. Use parent io.github.hjuutilainen.download.GIMP instead.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
