<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of the Contour Shuttle Driver.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.ContourShuttleDriver</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Contour Shuttle Driver</string>
        <key>SEARCH_URL</key>
        <string>https://www.contourdesign.com/support/drivers/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https://www.contourdesign.com/wp-content/uploads/[0-9.]+/[0-9.]+/Contour-Shuttle-(?P&lt;version&gt;[0-9.]+)\.zip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>Contour-Shuttle-Driver.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
