<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of the Google Voice and Video Plugin and copies the package to the build directory with an appended version number.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.pkg.GoogleVoiceAndVideo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleVoiceAndVideo</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.GoogleVoiceAndVideo</string>
    <key>Process</key>
    <array>
       <dict>
           <key>Arguments</key>
           <dict>
               <key>flat_pkg_path</key>
               <string>%pathname%/Google Voice and Video.pkg</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/expand</string>
           </dict>
           <key>Processor</key>
           <string>FlatPkgUnpacker</string>
       </dict>
       <dict>
           <key>Arguments</key>
           <dict>
               <key>pkg_payload_path</key>
               <string>%RECIPE_CACHE_DIR%/expand/Google_Voice_and_Video.pkg/Payload</string>
               <key>destination_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack</string>
           </dict>
           <key>Processor</key>
           <string>PkgPayloadUnpacker</string>
       </dict>
       <dict>
           <key>Arguments</key>
           <dict>
               <key>input_plist_path</key>
               <string>%RECIPE_CACHE_DIR%/unpack/Library/Internet Plug-Ins/googletalkbrowserplugin.plugin/Contents/Info.plist</string>
               <key>plist_version_key</key>
               <string>CFBundleVersion</string>
           </dict>
           <key>Processor</key>
           <string>Versioner</string>
       </dict>
       <dict>
           <key>Arguments</key>
           <dict>
               <key>source_pkg</key>
               <string>%pathname%/Google Voice and Video.pkg</string>
               <key>pkg_path</key>
               <string>%RECIPE_CACHE_DIR%/Google Voice and Video-%version%.pkg</string>
           </dict>
           <key>Processor</key>
           <string>PkgCopier</string>
       </dict>
    </array>
</dict>
</plist>
