<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest BigFix Utilities, and installs QnA to /Applications/Utilities.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.install.QnA</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BESEngine</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.rustymyers.download.BigFixUtilities</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>InstallFromDMG</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
                <key>items_to_copy</key>
                <array>
                    <dict>
                    <key>source_item</key>
                        <string>QnA.app</string>
                        <key>destination_path</key>
                        <string>/Applications/Utilities</string>
                        <key>user</key>
                        <string>root</string>
                        <key>group</key>
                        <string>admin</string>
                        <key>mode</key>
                        <string>ug+rwx</string>
                    </dict>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>