<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version FileZilla Win Client.</string>
    <key>Identifier</key>
    <string>ecom.github.hansen-m.download.FileZilla-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
        <key>SEARCH_URL</key>
        <string>https://filezilla-project.org/download.php?show_all=1</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>The latest stable version of FileZilla Client is (?P&lt;version&gt;[0-9.]+)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://sourceforge\.net/projects/filezilla/files/FileZilla_Client/%version%/FileZilla_%version%_win32-setup\.exe/download\?nowrap)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>