<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version FileZilla Win Client.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.FileZilla-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11_3) AppleWebKit/601.4.4 (KHTML, like Gecko) Version/9.0.3 Safari/601.4.4</string>
        <key>SEARCH_URL</key>
        <string>https://download.filezilla-project.org/client/</string>
        <key>VERSION_URL</key>
        <string>https://filezilla-project.org/download.php?type=client</string>
        <key>CHANNEL</key>
        <string>release</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
		<dict>
		    <key>Processor</key>
		    <string>com.github.rustymyers.SharedProcessors/FossHubURLProvider</string>
		    <key>Arguments</key>
		    <dict>
		        <key>app_name</key>
		        <string>FileZilla</string>
				<key>app_type</key>
				<string>64-bit Windows Portable</string>
		    </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<!-- Due to the use of mirrors, the ETag and Modified Dates cannot be used -->
          		<key>CHECK_FILESIZE_ONLY</key>
          		<true/>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>FileZilla.exe</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
