<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version FileZilla for Mac Client.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.FileZilla</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
        <key>SEARCH_URL</key>
        <string>https://download.filezilla-project.org/client/</string>
        <key>VERSION_URL</key>
        <string>https://filezilla-project.org/download.php?type=client</string>
        <key>CHANNEL</key>
        <string>release</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Consider switching to the FileZilla recipes in the keeleysam-recipes repo. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%VERSION_URL%</string>
                <key>re_pattern</key>
                <string>The latest stable version of FileZilla Client is ([0-9.]+)</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<!-- Due to the use of mirrors, the ETag and Modified Dates cannot be used -->
          		<key>CHECK_FILESIZE_ONLY</key>
          		<true/>
                <key>url</key>
                <string>https://download.filezilla-project.org/client/FileZilla_%version%_macosx-x86.app.tar.bz2</string>
                <key>filename</key>
                <string>%NAME%.tar.bz2</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
