<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Adobe Digital Editions.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.AdobeDigitalEditions</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeDigitalEditions</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.adobe.com/products/digital-editions/download.html</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://download\.adobe\.com/pub/adobe/digitaleditions/ADE_(?P&lt;version&gt;.*?)_Installer\.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>