<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and installs the latest Adobe Digital Editions from Adobe.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.install.AdobeDigitalEditions</string>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.AdobeDigitalEditions</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeDigitalEditions</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Installer</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%/Digital Editions [0-9].* Installer.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
