<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version JuliaStudio.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.juliastudio</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>JuliaStudio</string>
        <key>SEARCH_URL</key>
        <string>http://forio.com/julia/downloads/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;url&gt;https://s3\.amazonaws\.com/cdn-common\.forio\.com/julia-studio/.*?/julia-studio-macx-installer-.*?\.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Development and distribution of Julia Studio has been discontinued (details: https://github.com/forio/julia-studio/issues/268#issuecomment-552118996). This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
