<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Polycom RealPresence (RP) Desktop.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.PolycomRPDesktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PolycomCMADesktop</string>
        <key>SEARCH_URL</key>
        <string>http://support.polycom.com/PolycomService/support/us/support/video/realpresence_desktop/realpresence_desktop.html</string>
        <key>POLYCOMRPDESKTOP_REPATTERN</key>
        <string>http://support.polycom.com/PolycomService/support/us/support/eula/rpd/RPDagreement.*?_mac.html</string>
        <key>POLYCOMRPDESKTOP_DMG_REPATTERN</key>
        <string>http://downloads\.polycom\.com/video/realpresence_desktop/RPDmac-release_(?P&lt;version&gt;.*?)_(?P&lt;bundle_version&gt;.*?)\.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>(?P&lt;link&gt;%POLYCOMRPDESKTOP_REPATTERN%)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%link%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;%POLYCOMRPDESKTOP_DMG_REPATTERN%)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>