<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Skype for Business for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Skype-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Skype</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.skype.com/go/getskype-msi</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>MSIExtract</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>ignore_errors</key>
                <string>True</string>
                <key>exe_path</key>
                <string>%RECIPE_CACHE_DIR%/MSIExtract/Skype.exe</string>
                <key>extract_dir</key>
                <string>EXEExtract</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/BESRelevanceProvider</string>
            <key>Arguments</key>
            <dict>
                <key>bes_filepath</key>
                <string>%pathname%</string>
                <key>output_var_name</key>
                <string>version</string>
                <key>bes_relevance</key>
                <string>substring between "%22" of lines whose (it starts with "    version=") of file "%RECIPE_CACHE_DIR%/EXEExtract/.rsrc/0/MANIFEST/1" as version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
                <array>
                    <string>%RECIPE_CACHE_DIR%/MSIExtract</string>
                    <string>%RECIPE_CACHE_DIR%/EXEExtract</string>
                </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
