<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MeshLab.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.MeshLab</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MeshLab</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>SOURCEFORGE_FILE_PATTERN</key>
				<string>\.dmg</string>
				<key>SOURCEFORGE_PROJECT_ID</key>
				<integer>149444</integer>
			</dict>
			<key>Processor</key>
			<string>com.github.jessepeterson.munki.GrandPerspective/SourceForgeURLProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>

