<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Scribus. DOWNLOAD_FORMAT can be either 'pkg' or 'dmg', default is 'pkg'.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Scribus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MeshLab</string>
        <key>RSS_FEED</key>
        <string>http://sourceforge.net/projects/meshlab/rss?path=/meshlab</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%RSS_FEED%</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://sourceforge.net/projects/meshlab/files/meshlab/MeshLab%20v.*?/MeshLabMac_v.*?.dmg/download)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>