<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Inkscape. You may choose between dmg and dmg-arm64 as architecture; this recipe defaults to dmg (Intel).</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.Inkscape</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Inkscape</string>
        <key>SEARCH_URL</key>
        <string>https://inkscape.org</string>
        <key>SEARCH_PATTERN1</key>
        <string>(/release/([0-9]{1,3}.[0-9]{0,3}.[0-9]{0,3})/mac-os-x/)</string>
        <key>SEARCH_PATTERN2</key>
        <string>(/%ARCHITECTURE%/dl)</string>  
        <key>SEARCH_PATTERN3</key>
        <string>(?P&lt;dmgurl&gt;\/gallery\/.*Inkscape.*dmg)</string>  
        <key>ARCHITECTURE</key>
        <string>dmg</string>  
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%/release</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN1%</string>
                <key>result_output_var_name</key>
                <string>release_page_match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%%release_page_match%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN2%</string>
                <key>result_output_var_name</key>
                <string>arch_release_page_match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%%release_page_match%%arch_release_page_match%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN3%</string>
                <key>result_output_var_name</key>
                <string>gallery_download_match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%%gallery_download_match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/Inkscape.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/Inkscape*.*app</string>
                <key>requirement</key>
                <string>identifier "org.inkscape.Inkscape" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SW3D6BB6A6</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
