<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version GNUPlot.</string>
	<key>Identifier</key>
	<string>com.github.hansen-m.download.GNUPlot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GNUPlot</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.9</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://sourceforge.net/api/file/index/project-id/2055/mtime/desc/limit/20/rss</string>
                <key>re_pattern</key>
                <string>(?P&lt;url&gt;http://sourceforge.net/projects/gnuplot/files/gnuplot/(?P&lt;version&gt;.*?)/gnuplot-.*?.tar.gz/download)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.tar.gz</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>