<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Notepad++ for Windows.</string>
    <key>Identifier</key>
    <string>com.github.hansen-m.download.NotepadPlusPlus-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Notepad++</string>
        <key>BASE_URL</key>
        <string>https://notepad-plus-plus.org</string>
        <key>SEARCH_URL</key>
        <string>https://notepad-plus-plus.org/download/</string>
        <key>SEARCH_PATTERN</key>
        <string>(?P&lt;exe_download_path&gt;/repository/[6-9].x/[0-9.]+/npp.(?P&lt;version&gt;[0-9.]+).Installer.exe)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%BASE_URL%/%exe_download_path%</string>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>